{
  "about": {
    "title": "Sobre esta web",
    "subtitle": "驴Por qu茅 esta p谩gina? | 驴Para qu茅 sirve?",
    "description1": "隆Buenas ! Esta web sirve como portfolio personal y a la vez como proyecto para aprender m谩s sobre Angular y un framework de CSS que me gusta mucho llamado Bulma.",
    "description2": "Para crearla, us茅 Angular 18 con Server Side Rendering, Bulma como framework de CSS, AOS para las animaciones y Gulp para su compresi贸n. Tambi茅n me gusta usar ESLint para tener el c贸digo m谩s ordenado y Vercel me ha parecido una muy buena idea como plataforma de hosting para el proyecto .",
    "description3": "Tambi茅n, ya que soy propietario del dominio <b>mapach.es</b> , he decidido ponerlo en uso utiliz谩ndolo para esta p谩gina .",
    "repository": "隆Mira el repositorio del proyecto en GitHub!"
  },
  "contact": {
    "title": "癸 Informaci贸n de Contacto:",
    "subtitle": "Aqu铆 dejo algunos recursos para poder comunicarse conmigo:",
    "email": {
      "label": "Correo Electr贸nico :",
      "address": "arc.2dominguez@gmail.com"
    },
    "phone": {
      "label": "Tel茅fono :",
      "number": "+34-611-602-882"
    },
    "linkedin": {
      "label": "LinkedIn",
      "icon": "/assets/icons/linkedinIcon.svg",
      "text": "LinkedIn Alejandro Ramos Casado"
    },
    "resume": {
      "text": "No olvides ver mi",
      "button": "Curr铆culum Vitae"
    }
  },
  "education": {
    "title": "Educaci贸n"
  },
  "experience": {
    "title": "Experiencia"
  },
  "knowledge": {
    "title": "Conocimientos"
  },
  "home": {
    "title1": "Alejandro Ramos Casado",
    "description": "P谩gina de presentaci贸n personal",
    "bio": "Alejandro Ramos Casado es programador web y artista t茅cnico, con experiencia en desarrollo de aplicaciones, entornos 3D y sistemas interactivos. Especializado en JavaScript, Java y frameworks como Angular, tambi茅n maneja motores gr谩ficos como Blender. Su enfoque autodidacta y habilidades en trabajo en equipo destacan en proyectos tecnol贸gicos y creativos.",
    "phrases": [
      "programador",
      "administrador de sistemas",
      "artista t茅cnico",
      "riggeador"
    ],
    "cv": "Ver curr铆culum",
    "title2": "Descripci贸n personal:"
  },
  "header": {
    "home": "Inicio",
    "experience": "Experiencia",
    "education": "Educaci贸n",
    "knowledge": "Conocimientos",
    "about": "Sobre esta p谩gina",
    "contact": "Contacto",
    "cv": "Curr铆culum Vitae",
    "projects": "Proyectos",
    "gh-project": "Repositorio Portfolio",
    "gh-profile": "Perfil Alejandro Ramos"
  },
  "cards-exp": [
    {
      "imgBig": "/assets/tlpLogo.jpg",
      "imgBigAlt": "Logo TLP",
      "imgSmall": "/assets/sm/routerSmallLogo.png",
      "imgSmallAlt": "Mini logo TLP",
      "mainTitle": "Administrador de sistemas",
      "subtitle": "TELEPALMA S.L - La Palma del Condado, Huelva - 2020",
      "description": "Programador de sistemas de fibra 贸ptica basados en Linux.",
      "routerLink": "exp-0"
    },
    {
      "imgBig": "/assets/ccarmenLogo.png",
      "imgBigAlt": "Logo Confiter铆a del Carmen",
      "imgSmall": "/assets/sm/devWebSmallLogo.png",
      "imgSmallAlt": "Mini logo Confiter铆a del Carmen",
      "mainTitle": "Desarrollador Web",
      "subtitle": "CONFITERA DEL CARMEN, La Palma del Condado, Huelva - 2021",
      "description": "Desarrollador de p谩gina web de ventas en Wordpress.",
      "routerLink": "exp-1"
    },
    {
      "imgBig": "/assets/tmbrLogo.png",
      "imgBigAlt": "Logo Timberfilms",
      "imgSmall": "/assets/sm/riggerSmallLogo.png",
      "imgSmallAlt": "Mini logo Timberfilms",
      "mainTitle": "Artista t茅cnico de personajes 3D",
      "subtitle": "TIMBERFILMS - Sevilla - 2022",
      "description": "Rigger de personajes, creador de sistemas de movimiento para personajes 3D, y encargado del departamento de VFX y desarrollo t茅cnico.",
      "routerLink": "exp-2"
    },
    {
      "imgBig": "/assets/andreaPic.png",
      "imgBigAlt": "Imagen de proyecto de Telepalma",
      "imgSmall": "/assets/sm/andreaSmallLogo.png",
      "imgSmallAlt": "Mini logo Telepalma",
      "mainTitle": "Programador y modelador 3D",
      "subtitle": "TELEPALMA S.L - La Palma del Condado, Huelva - 2023",
      "description": "Director, programador y editor de v铆deo en un proyecto de realidad virtual 3D.",
      "routerLink": "exp-3"
    },
    {
      "imgBig": "/assets/guadalinfoPic.png",
      "imgBigAlt": "Logo Guadalinfo",
      "imgSmall": "/assets/sm/guadalinfoSmallLogo.png",
      "imgSmallAlt": "Mini logo Guadalinfo",
      "mainTitle": "Dinamizador y gestor",
      "subtitle": "GUADALINFO - La Palma del Condado, Huelva - 2023",
      "description": "Profesor de cursos de ofim谩tica tanto para adultos como ni帽os, y ayudante de gestiones administrativas a m煤ltiples entidades.",
      "routerLink": "exp-4"
    }
  ],
  "cards-know": [
    {
      "imgBig": "/assets/javaLogo.png",
      "imgBigAlt": "Logo Java",
      "imgSmall": "/assets/sm/javaSmallLogo.png",
      "imgSmallAlt": "Mini logo Java",
      "mainTitle": "Java",
      "subtitle": "Conocimientos en el desarrollo con Java",
      "description": "Conocimientos en el desarrollo con Java 21 y algoritmos para desarrollo de escritorio.",
      "routerLink": "know-0"
    },
    {
      "imgBig": "/assets/tsjsLogo.png",
      "imgBigAlt": "Logo Javascript | Typescript",
      "imgSmall": "/assets/sm/jsSmallLogo.png",
      "imgSmallAlt": "Mini logo Javascript",
      "mainTitle": "Javascript | Typescript",
      "subtitle": "Desarrollo usando lenguajes como Javascript y Typescript",
      "description": "Programaci贸n tanto en Typescript como Javascript tanto para backend como frontend usando Node.js y librer铆as como Express.js, React o frameworks como Angular.",
      "routerLink": "know-1"
    },
    {
      "imgBig": "/assets/angLogo.png",
      "imgBigAlt": "Logo Angular",
      "imgSmall": "/assets/sm/angSmallLogo.png",
      "imgSmallAlt": "Mini logo Angular",
      "mainTitle": "Angular 18",
      "subtitle": "Conocimientos y experiencias desarrollando p谩ginas usando Angular 18",
      "description": "Experiencia creando p谩ginas web usando Angular 18 y Node.js con npm/pnpm.",
      "routerLink": "know-2"
    },
    {
      "imgBig": "/assets/ubudebLogo.png",
      "imgBigAlt": "Logo Debian/Ubuntu",
      "imgSmall": "/assets/sm/linuxSmallLogo.png",
      "imgSmallAlt": "Mini logo Linux",
      "mainTitle": "Sistemas Linux (Basados en Debian)",
      "subtitle": "Conocimientos y experiencia en la creaci贸n de servidores basados en Linux",
      "description": "Experiencia en sistemas Linux (Debian, Ubuntu y Ubuntu Server, etc)",
      "routerLink": "know-3"
    },
    {
      "imgBig": "/assets/vmLogo.png",
      "imgBigAlt": "Logo Debian/Ubuntu",
      "imgSmall": "/assets/sm/vmSmallLogo.png",
      "imgSmallAlt": "Mini logo VMs",
      "mainTitle": "VMWare, VirtualBox y Qemu (KVM)",
      "subtitle": "Uso de VMWare, VirtualBox y Qemu",
      "description": "Experiencia utilizando m谩quinas virtuales como VMWare, VirtualBox y QEMU/KVM",
      "routerLink": "know-4"
    },
    {
      "imgBig": "/assets/gitLogo.png",
      "imgBigAlt": "Logo Git",
      "imgSmall": "/assets/sm/vmSmallLogo.png",
      "imgSmallAlt": "Mini logo VMs",
      "mainTitle": "Git",
      "subtitle": "Conocimiento de control de versiones usando Git",
      "description": "Uso de Git y GitFlow para el versionamiento y trabajo continuo",
      "routerLink": "know-5"
    }
  ],
  "details-exp": [
    {
      "title": "Administrador de sistemas",
      "image": "/assets/tlpLogo.jpg",
      "imageAlt": "Logo TLP",
      "subtitle": "Programador de sistemas de fibra 贸ptica basados en Linux.",
      "description": "Trabaj贸 con Linux, un sistema operativo de c贸digo abierto reconocido por su estabilidad y flexibilidad. Configur贸 y mantuvo sistemas de telecomunicaciones, optimizando redes de fibra 贸ptica para garantizar un rendimiento eficiente en entornos t茅cnicos complejos.",
      "descriptionSubject": "Linux es un sistema operativo de c贸digo abierto conocido por su estabilidad y flexibilidad. Es ampliamente utilizado en servidores, dispositivos integrados y redes por su capacidad para personalizarse y su robustez en entornos t茅cnicos como sistemas de telecomunicaciones.",
      "routerLink": "exp-0"
    },
    {
      "title": "Desarrollador Web",
      "image": "/assets/ccarmenLogo.png",
      "imageAlt": "Logo Confiteria Carmen",
      "subtitle": "Desarrollador de aplicaciones web.",
      "description": "Desarroll贸 sitios web utilizando WordPress, un sistema de gesti贸n de contenido que facilita la creaci贸n de p谩ginas web y tiendas en l铆nea. Personaliz贸 dise帽os y funcionalidades, integrando herramientas como plugins y plataformas de e-commerce.",
      "descriptionSubject": "WordPress es un sistema de gesti贸n de contenido (CMS) que permite crear sitios web y blogs de forma sencilla. Es popular por su interfaz intuitiva, personalizaci贸n a trav茅s de temas y plugins, y su capacidad para manejar tiendas online con herramientas como WooCommerce.",
      "routerLink": "exp-1"
    },
    {
      "title": "Artista t茅cnico de personajes 3D",
      "image": "/assets/tmbrLogo.png",
      "imageAlt": "Logo TimberFilms",
      "subtitle": "Rigger de personajes, creador de sistemas de movimiento para personajes 3D",
      "description": "Cre贸 sistemas de rigging para personajes en 3D, dise帽ando estructuras digitales que permitieron movimientos naturales y precisos. Este trabajo fue fundamental para lograr animaciones realistas en proyectos audiovisuales y videojuegos.",
      "descriptionSubject": "El rigging es un proceso en animaci贸n 3D que consiste en crear un esqueleto digital (huesos y controles) para que un modelo pueda moverse de forma realista. Es esencial en animaciones de personajes y en videojuegos.",
      "routerLink": "exp-2"
    },
    {
      "title": "Programador y modelador 3D",
      "image": "/assets/andreaPic.png",
      "imageAlt": "Logo TimberFilms",
      "subtitle": "Director, programador y editor de v铆deo en un proyecto de realidad virtual 3D.",
      "description": "Gestion贸 proyectos de realidad virtual, desarrollando entornos inmersivos en 3D mediante programaci贸n y modelado avanzado. Coordin贸 la edici贸n de contenido y lider贸 la parte t茅cnica para ofrecer experiencias innovadoras.",
      "descriptionSubject": "La realidad virtual es una tecnolog铆a que permite a los usuarios experimentar entornos simulados en 3D mediante dispositivos como gafas VR. Ofrece experiencias inmersivas para juegos, formaci贸n, simulaciones y entretenimiento.",
      "routerLink": "exp-3"
    },
    {
      "title": "Dinamizador y gestor",
      "image": "/assets/guadalinfoPic.png",
      "imageAlt": "Logo Guadalinfo",
      "subtitle": "Profesor y ayudante de gestiones administrativas a m煤ltiples entidades.",
      "description": "Realiz贸 tareas administrativas, organiz贸 documentos, optimiz贸 procesos internos y ofreci贸 soporte personalizado a usuarios. Estas acciones contribuyeron a mejorar la gesti贸n y eficiencia en diversas entidades.",
      "descriptionSubject": "Consiste en llevar a cabo tareas organizativas como la tramitaci贸n de documentos, la gesti贸n de datos y la atenci贸n a usuarios, facilitando los procesos internos de una empresa u organizaci贸n.",
      "routerLink": "exp-4"
    }
  ],
  "details-edu": [
    {
      "title": "Desarrollo de Aplicaciones Web (ADA-ITS, Sevilla, Actualidad)",
      "image": "/assets/adaitsLogo.png",
      "imageAlt": "Logo ADA ITS",
      "subtitle": "Desarrollo de Aplicaciones Web (DAW)",
      "description": "Actualmente cursa estudios de Desarrollo de Aplicaciones Web, donde adquiere conocimientos avanzados en programaci贸n, dise帽o de interfaces, bases de datos y tecnolog铆as web modernas. Este programa forma a profesionales capacitados para desarrollar soluciones tecnol贸gicas completas en entornos digitales.",
      "descriptionSubject": "El desarrollo de aplicaciones web se centra en la creaci贸n de software accesible a trav茅s de navegadores. Combina programaci贸n, dise帽o de interfaces y gesti贸n de bases de datos para construir plataformas din谩micas, como tiendas online, sistemas de gesti贸n o servicios interactivos. Incluye tecnolog铆as como HTML, CSS, JavaScript y frameworks modernos.",
      "routerLink": "edu-0"
    },
    {
      "title": "Desarrollo de Videojuegos y Entornos Interactivos (Centro Universitario EUSA, Sevilla, 2020-2022)",
      "image": "/assets/eusaLogo.png",
      "imageAlt": "Logo Centro Eusa",
      "subtitle": "Desarrollo de Videojuegos y Entornos Interactivos (A3D)",
      "description": "Complet贸 estudios especializados en Desarrollo de Videojuegos y Entornos Interactivos, aprendiendo dise帽o y programaci贸n de videojuegos, motores gr谩ficos, modelado 3D y creaci贸n de experiencias interactivas. Este aprendizaje combin贸 aspectos art铆sticos y t茅cnicos aplicados a la industria del entretenimiento digital.",
      "descriptionSubject": "Este campo se enfoca en la creaci贸n de videojuegos y experiencias interactivas, integrando dise帽o visual, programaci贸n y narrativas digitales. Utiliza motores gr谩ficos como Unity y Blender para desarrollar entornos 3D y mec谩nicas de juego, siendo esencial para la industria del entretenimiento y simulaciones educativas.",
      "routerLink": "edu-1"
    },
    {
      "title": "Sistemas Microinform谩ticos y Redes",
      "image": "/assets/dhPic.png",
      "imageAlt": "Logo Delgado Hernandez",
      "subtitle": "Sistemas Microinform谩ticos y Redes (SMR)",
      "description": "Estudi贸 Sistemas Microinform谩ticos y Redes, donde adquiri贸 habilidades en instalaci贸n, configuraci贸n y mantenimiento de equipos inform谩ticos y redes. Este programa se enfoc贸 en el manejo de sistemas operativos, seguridad inform谩tica y administraci贸n de infraestructuras tecnol贸gicas.",
      "descriptionSubject": "El 谩rea de sistemas microinform谩ticos y redes abarca la instalaci贸n, configuraci贸n y mantenimiento de hardware y software. Incluye la administraci贸n de redes locales, seguridad inform谩tica y soluci贸n de problemas t茅cnicos, formando la base de infraestructuras tecnol贸gicas modernas.",
      "routerLink": "edu-2"
    }
  ],
  "details-know": [
    {
      "title": "Java",
      "image": "/assets/javaLogo.png",
      "imageAlt": "Logo de Java",
      "subtitle": "Conocimientos en el desarrollo con Java",
      "description": "Posee conocimientos en el desarrollo de aplicaciones con Java 21, aplicando conceptos avanzados de programaci贸n y algoritmos orientados a aplicaciones de escritorio. Domina principios como la orientaci贸n a objetos, estructuras de datos y patrones de dise帽o, fundamentales para el desarrollo eficiente de software robusto.",
      "descriptionSubject": "Java es un lenguaje de programaci贸n de alto nivel, ampliamente utilizado por su portabilidad y robustez. Es ideal para desarrollar aplicaciones de escritorio, sistemas empresariales y aplicaciones Android, gracias a su enfoque en la orientaci贸n a objetos y su capacidad para ejecutarse en m煤ltiples plataformas mediante la M谩quina Virtual de Java (JVM).",
      "routerLink": "know-0"
    },
    {
      "title": "Javascript | Typescript",
      "image": "/assets/tsjsLogo.png",
      "imageAlt": "Logo de Typescript y Javascript",
      "subtitle": "Maestr铆a en ciencias de la computaci贸n en la Universidad ABC.",
      "description": "Domina la programaci贸n en JavaScript y TypeScript, tanto en el backend como en el frontend. Utiliza Node.js junto con librer铆as como Express.js y React, adem谩s de frameworks modernos como Angular. Tiene experiencia en el desarrollo de aplicaciones completas, desde servidores hasta interfaces de usuario.",
      "descriptionSubject": "JavaScript es un lenguaje de programaci贸n din谩mico que se utiliza principalmente para el desarrollo web, tanto en el frontend como en el backend. TypeScript es una extensi贸n de JavaScript que a帽ade tipado est谩tico, mejorando la detecci贸n de errores y el mantenimiento del c贸digo en proyectos de gran escala.",
      "routerLink": "know-1"
    },
    {
      "title": "Angular 18",
      "image": "/assets/angLogo.png",
      "imageAlt": "Logo de Angular",
      "subtitle": "Experiencia creando p谩ginas web usando Angular 18 y Node.js con npm/pnpm.",
      "description": "Cuenta con experiencia significativa en el desarrollo de p谩ginas web utilizando Angular 18, combinado con Node.js y gestores de paquetes como npm/pnpm. Ha trabajado en la creaci贸n de interfaces din谩micas y modernas, aplicando las mejores pr谩cticas en desarrollo frontend y arquitectura web.",
      "descriptionSubject": "Angular es un framework de desarrollo frontend basado en TypeScript que permite crear aplicaciones web din谩micas de una sola p谩gina (SPA). Angular 18 incluye herramientas avanzadas para gestionar estados, enrutamiento y optimizar el rendimiento de las aplicaciones modernas.",
      "routerLink": "know-2"
    },
    {
      "title": "Sistemas Linux (Basados en Debian)",
      "image": "/assets/ubudebLogo.png",
      "imageAlt": "Logo de Ubuntu y Debian",
      "subtitle": "Experiencia en sistemas Linux ( Debian, Ubuntu y Ubuntu Server, etc)",
      "description": "Tiene experiencia en la administraci贸n de sistemas basados en Linux, incluyendo Debian, Ubuntu y Ubuntu Server. Esto incluye la configuraci贸n de servidores, gesti贸n de redes y resoluci贸n de problemas, destacando un s贸lido conocimiento de protocolos, paquetes y seguridad en entornos Linux.",
      "descriptionSubject": "Debian y Ubuntu son distribuciones de Linux populares por su estabilidad y facilidad de uso. Linux es un sistema operativo de c贸digo abierto que permite la administraci贸n avanzada de servidores, redes y sistemas, siendo esencial para entornos tecnol贸gicos profesionales.",
      "routerLink": "know-3"
    },
    {
      "title": "VMWare, VirtualBox y Qemu (KVM)",
      "image": "/assets/vmLogo.png",
      "imageAlt": "Logo de VMWare, VirtualBox y QEMU",
      "subtitle": "Experiencia utilizado m谩quinas virtuales como VMWare, VirtualBox y QEMU/KVM",
      "description": "Utiliza herramientas de virtualizaci贸n como VMWare, VirtualBox y QEMU/KVM para configurar y gestionar m谩quinas virtuales. Estas habilidades permiten la creaci贸n de entornos simulados para pruebas, desarrollo y despliegues seguros, optimizando recursos tecnol贸gicos.",
      "descriptionSubject": "VMWare, VirtualBox y QEMU (con Kernel-based Virtual Machine) son herramientas de virtualizaci贸n que permiten crear y administrar m谩quinas virtuales. Estas tecnolog铆as se utilizan para simular entornos de hardware, facilitando pruebas, desarrollo y despliegues sin necesidad de hardware adicional.",
      "routerLink": "know-4"
    },
    {
      "title": "Git",
      "image": "/assets/gitLogo.png",
      "imageAlt": "Logo de Git",
      "subtitle": "Uso de Git y GitFlow para el versionamiento y trabajo continuo",
      "description": "Domina el uso de Git para control de versiones, aplicando flujos de trabajo como GitFlow para facilitar la colaboraci贸n y el desarrollo continuo. Este conocimiento asegura la gesti贸n eficiente de proyectos, manteniendo la organizaci贸n y el historial del c贸digo fuente.",
      "descriptionSubject": "Git es un sistema de control de versiones distribuido utilizado para rastrear cambios en el c贸digo fuente. Permite a los desarrolladores colaborar en proyectos, gestionar diferentes versiones y aplicar flujos de trabajo eficientes como GitFlow para mantener la organizaci贸n y calidad del c贸digo.",
      "routerLink": "know-5"
    }
  ],
  "seemore": "Ver m谩s",
  "goback": "Volver atr谩s",
  "thanktoast": "隆Gracias! ",
  "lang-eng": "Ingl茅s",
  "lang-esp": "Espa帽ol",
  "cv-url": "https://drive.google.com/file/d/101wqVS622fxIvwle3D57HvTfwjzielyZ/view?usp=sharing"
}
